IDEA StatiCa Open Model
AnchorType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Defines a type of anchor end.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum AnchorType
Public Enumeration AnchorType
public enum class AnchorType
Members
Member name | Value | Description
Straight | 0 |  Straight end - no washer.
WasherPlateCircular | 1 |  Circular washer plate.
WasherPlateRectangular | 2 |  Rectangular washer plate.
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace